### 1.Quiz.csv 파일을 불러와 출력하기

In [1]:
import pandas as pd
df = pd.read_csv("data/1.Quiz.csv")
df

   경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
0   39060    7313    3627     309     300     B
1   39896    6967    4168    1771     350     B
2   42005    6873    4088    1954     450     A
3   43621    6626    4424    2244     560     A
4   41702    8675    4606    3146    1300     A
5   41266   10622    4984    3945    2395     A
6   32427    9228    5570    5766    3786     C

### 2. index 설정

In [7]:
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']
df.index = index_list
df

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A
2016   41266   10622    4984    3945    2395     A
2017   32427    9228    5570    5766    3786     C

### 3. 컬럼 조회

- 컬럼들만 추출

In [8]:
df.columns

Index(['경부선KTX', '호남선KTX', '경전선KTX', '전라선KTX', '동해선KTX', '경부선등급'], dtype='object')

- 경부선KTX 열만 조회

In [9]:
df['경부선KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선KTX, dtype: int64

- 경부선KTX, 호남선KTX 컬럼 조회

In [10]:
df[['경부선KTX', '호남선KTX']]

      경부선KTX  호남선KTX
2011   39060    7313
2012   39896    6967
2013   42005    6873
2014   43621    6626
2015   41702    8675
2016   41266   10622
2017   32427    9228

- 인덱싱 사용하여 행기준 조회 (2012-2015)
    - 인덱스 번호 이용

In [11]:
df[1:5]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

- 인덱싱 사용하여 행기준 조회 (2012-2015)
    - 인덱스 이름 이용

In [12]:
df['2012':'2015']

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

### loc를 이용한 조회

- loc 사용하여 컬럼이 '경부선KTX'의 모든행 조회

In [15]:
df.loc[: , ['경부선KTX']]

      경부선KTX
2011   39060
2012   39896
2013   42005
2014   43621
2015   41702
2016   41266
2017   32427

- 2011년 데이터만 가져오기

In [16]:
df.loc[['2011']]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B

- 2013 - 2016 데이터 가져오기

In [17]:
df.loc['2013':'2016']

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A
2016   41266   10622    4984    3945    2395     A

- 2012 - 2014 경부선KTX 컬럼 조회
    - loc 사용

In [18]:
df.loc['2012':'2014', ['경부선KTX']]

      경부선KTX
2012   39896
2013   42005
2014   43621

- 2012 - 2014 경부선KTX 컬럼 조회
    - loc 사용 안함

In [24]:
df['2012':'2014'][['경부선KTX']]

      경부선KTX
2012   39896
2013   42005
2014   43621

- 2015 - 2017까지 경부선KTX, 호남선KTX, 동해선KTX 조회

In [25]:
df.loc['2015':'2017', ['경부선KTX', '호남선KTX', '동해선KTX']]

      경부선KTX  호남선KTX  동해선KTX
2015   41702    8675    1300
2016   41266   10622    2395
2017   32427    9228    3786

- isin 사용
    - 경부선 등급이 'B', 'C'인 데이터 조회

In [28]:
df.loc[df['경부선등급'].isin(['B','C'])]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2017   32427    9228    5570    5766    3786     C

- 위 조건을 만족하는 경부선KTX만 조회

In [34]:
df.loc[df['경부선등급'].isin(['B','C']),['경부선KTX']]

      경부선KTX
2011   39060
2012   39896
2017   32427